brew "cloudflared"
brew "gh"
brew "git"
brew "pyenv"
brew "starship"
brew "vim"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "balenaetcher"
cask "cloudflare-warp"
cask "discord"
cask "docker-desktop"
cask "google-japanese-ime"
cask "iterm2"
cask "jetbrains-toolbox"
cask "slack"
cask "visual-studio-code"
