tap "homebrew/bundle"
brew "git"
brew "starship"
brew "vim"
cask "balenaetcher"
cask "discord"
cask "docker"
cask "fig"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "jetbrains-toolbox"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "slack"
cask "visual-studio-code"
vscode "alefragnani.project-manager"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "esafirm.kotlin-formatter"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kaiwood.endwise"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mathiasfrohlich.kotlin"
vscode "mhutchie.git-graph"
vscode "michelemelluso.gitignore"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "oderwat.indent-rainbow"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "pkief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "smelukov.vscode-csstree"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.move-ts"
vscode "sysken.hiding-twitter"
vscode "tecosaur.latex-utilities"
vscode "torn4dom4n.latex-support"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-maven"
vscode "withfig.fig"
vscode "yandeu.five-server"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
